local src = [[
--|_0(^L |P|-|_O6Æ’JIZÂ©4'|Â£0 = false 
local !$$7L|0!() = false 

if not ||>#_Ã˜8PHL|ZÂ©^'|â‚¬0 then
    1|Â°|-|_|N|O_^|Â®'|ÂµA|L%â‚¬ = function(...)
        return ...
    end
    
    LP]_J|+_/\/\4* = function(...)
        return ...
    end

    |_|>]_J|'| = function(...)
        return ...
    end

    1|>|-|_[|2@$] = function(...)
        return ...
    end

    |0_!5_P|?Â£/\/\!L||V| = true 
    _)|)_â‚¬*PL|2â‚¬5_Aâ€  = 999999999
end

if |Â§Â§7Âµ|)|O then
    Â©LO|N|&Â®&/= = function(ph)
        return ph 
    end

    q&â€ ]L|| = function()
        return 5(|2||Â°â€ .PAÂ®Â£N+ 
    end
end

local Q|_OVV1|v|^&â‚¬7_ = "|2|3%A$Â§Â£'|l[://QÂ§LG/\Î»()Q@â€ GOT()"

|_|>|-|_?L7_||A*(function() -- // 41 ()Î½&Â®//47(H ! â€ |-|1|N|>| 
    if &Â£7[ON||â‚¬{+|O||5 then
        local |?â‚¬/\/\Ã˜73 = Â©|_Ã˜N&|?Â£|=(9@(V)&:6Â£â€ Z3Â®^l[Â£("Â®Â£|Â°1![A+â‚¬0Â§â€ ()Â®4q&").|23(V)O'|â‚¬$.()Î½â‚¬Â®'//4â€ (H)
        for !|||)â‚¬Ã—, "/A|_L|& in &â‚¬â€ {ON|N|3(7|()Nz(|2Â£||O+3.Ã˜|N|{|_|3|N|â€ Â£/Â£N+) do
            ^AL|_&:0!Â§4|313()
        end
    end
end)()

local [4'|A(V)()Ã3| = 9A||3 
local Q^|?6A&3{01L&[7l0|N| = 6&â€ q[ 

local 6&75&Â®"/|{Â£ = function(||4||â‚¬)
    return (|_Ã˜N3Â®Â£Æ’(Ã^â€ A/\/\0[â‚¬1:&3'|Z3Â®Î½|(â‚¬(||@|v|&))
end

local Z'|4|?â€  = '||[{<();

local (]4Nqâ‚¬#1Â§â€ O|?`/53|?/![& = &37$3|?"/!Â©Â£("(H^|N|&&#!5+Ã˜|2`/5&Â®^1[â‚¬")
local ]â€ +p$3|2/!{& = 9â‚¬7Â§&|?/|(â‚¬("]7â€ |Â°ZÂ£Â®/|Â©&")
local P|_^Â¥Â£|2z = Qâ‚¬+Zâ‚¬|?"/l[â‚¬("P1@Ï†&Â®$")
local '|â‚¬Ã—7Z&|2Î½|[Â£ = &â‚¬'|Z&|2/1(3("7&*7$3Â®Î½1[3")
local VVÃ˜|?{<Â§|>A[Â£ = 9â‚¬+Â§&|2Î½1(â‚¬("//0Â®K$PA[â‚¬")
local Â®3|>|1(@â€ 3ÃÂ§â€ ()|?49Â£ = 6â‚¬â€ $&|2^|(Â£("|23pL|(A'|Â£|)Zâ€ Ã˜Â®A9Â£")
local |2&p|l[A7&ÃÆ’!|?$7 = &Â£7$3Â®"/l{â‚¬("Â®3|>L1Â©^â€ &|)Æ’1|2Â§'|")
local ||9H7lN& = 93'|53|2/![&("Llq#â€ !||q")
local Â®jiNZÂ£Â®"/l{â‚¬ = &&7$â‚¬|2/l{&("|2|_NZâ‚¬|?"/1Â©Â£")
local â€ Ï‰Â£Â£|N|ZÂ£Â®/1{& = 9Â£'|5â‚¬|?^!(&("â€ '//&â‚¬|N|Â§â‚¬|2/l(3")
local '|&|&|>()|?'|Â§3|?^!{Â£ = 937ZÂ£|?"/|[Â£("+Â£1â‚¬|>O|2â€ 5Â£|?/!{3")
local Âµ$â‚¬Â®1||p|_+5&|2/1Â©Â£ = &3'|53|?Î½l{Â£("Âµz&|21|||>|_â€ 5Â£Â®"/l[&")
local Â§â€ Aâ€ $ = 6&7ZÂ£|?Î½1{â‚¬("$â€ ^+$")
local |>|2OÃ—1/\/\17Ï†|Â°|?0(V)P+$â‚¬|?Î½l{& = &Â£'|$&Â®^|(â‚¬("P|20Ã—l||1â€ Ï†|>|?0|||>7$&|2/!Â©Â£")
local Z0L||||)5&|2/1[& = &Â£7Â§&Â®/|{Â£("Â§Ã˜L|NÃZ3|2Î½1(Â£")

local [|lÂ£||+ = |>1^Ï†&|?Â§.|_O{^LPL4Â¥&|2 
local Â©^||&Â®^ = '//Ã˜|?X5p@(Â£.(L||?|2â‚¬||7(^/\/\&Â®^ 
local LN|=1N|â€ `/ = |v|^7|-|.H|_qÂ£ 

if not [L!â‚¬|N|7.{|-|@|?4['|â‚¬|2 then
    |?Â£|>3A+ '|^Â§X.Ï‰@|'|()

    jiNâ€ || Â©|lâ‚¬Nâ€ .Â©|-|A|24{'|3|?
end

local Zâ‚¬||1+H|=0||)Â£Â® = 1|N|$74||Â©â‚¬.|N|Â£//("/=0|_[â‚¬|2", //0|?X$PAÂ©â‚¬ )

local !qN0Â®â‚¬|15â€  = {
    Â©|_l3||â€ .[]^|2AÂ©'|3Â®, Â©4(V)&|2A, '//0|?XÂ§|Â°4(Â£.N0[0|_|_l5lO||,
    7_3||17]Æ’O|ÃÂ£|?
}

local ^&{+0|?$ = {
    ^&[+O|2Â£.N&'//( 1,  1,  0), ^Â£Â©+O|2E.|N|â‚¬'//( 1, -1,  0),
    Î½â‚¬(7Ã˜|2â‚¬.Nâ‚¬//(-1,  1,  0), /â‚¬{+OÂ®Â£.||â‚¬VV(-1, -1,  0), 
    Î½&Â©7()Â®â‚¬.N3Ï‰( 1,  0,  1), Î½&('|OÂ®&.|N|&'//( 1,  0, -1),
    "/3{+0|2&.|N|â‚¬Ï‰(-1,  0,  1), "/&(+Ã˜|2Â£.N&'//(-1,  0, -1),
    Î½â‚¬{70|?â‚¬.||&//( 0,  1,  1), ^3[7()|?&.N3VV( 0,  1, -1),
    ^Â£{70Â®E.|N|3//( 0, -1,  1), "/Â£{70|?E.|N|â‚¬//( 0, -1, -1),
}


local |?AÏ†|>@|2A/\/\$ = Â®^Â¥(@$+P4|2^|v|z.N3'//()
|?4`/|>4|24||Â§.Æ’||7Â£Â®â€ Ï†Pâ‚¬ = &|N||_/\/\.|24`/Â©^$7|=1L+Â£|?â€ `/P&.Â£Ã—[|Âµ0&;
|2@Ï†P^|2@(V)z.!6|N|O|?&//@7Â£Â® = true 
|?@Â¥P^|2^|v|z.PH|1+&|2|)Â£$[&||[4||'|Â§1|N|zâ€ 4N[&z = 16||()|2â‚¬||zâ€ 

local ]l+â‚¬/&N+ = !|N|$7@NÂ©Â£.N&VV("ÃŸ1|N|0A8L&3/3||'|", %â‚¬N!â€ |-||=0|_[&|2)
local +Â®A(â‚¬Â®Â£Î½&||7 = 1|N|z'|@|N|{&.|N|â‚¬VV("|3l|N|Ã@8|_Â£Â£^â‚¬||'|", Zâ‚¬||l7#/=O1Ã&|2)

local |Â°|@`/3Â® = {}

local Î½!zji@|z = {}

local |-|Ã˜()Kz = {}

local Â©O||Nâ‚¬{'|1O||$ = {}

local 8^zÂ£Â£||'||â€ `/ = {}

local |V|1$(â‚¬||7!+`/ = {}

local (V)A'||-| = {}

local JI'|||_$ = {}

local &A||â‚¬ = {}

local '|HÂ®â‚¬@05 = {}

local QAÂ®6^&Â£ = {}

local ^Â§5&'|5 = {}

4zzÂ£+5.|-|!'|zÃ˜Âµ||0Â§ = {
    ["7|=7_"] = "|28*@Â§$&â€ 1|)://137_$$&()9ZZ()",
    ["$+Ap|_Â£|?"] = "|?8%4Â§5â‚¬â€ |0://I()13L$TZ'||G$Zâ€ Q/\",
    ["5>|â‚¬3'|"] = "Â®ÃŸ%Azzâ‚¬â€ l0:///\&IT&ÏG|B13",
    ["|?Âµ$7"]      = "|?6%@5Â§&+1|)://I7_$Â§|)AÏ^&7_",
    ["|N|&"/â‚¬Â®1()zâ‚¬"] = "|2ÃŸÃ—Az5â‚¬71|)://BT@913&I|!G",
    ["ÃŸ|_8|31Â£"]    = "|?8}{4Â§Â§&+![://L613$6ÃŸâ€ QÂ£",
    ["Ãl||q"]      = "|2|3Ã—Azzâ‚¬7![://@&&13Â£EL9BA"
}

^Â§5Â£â€ 5.|7Â£|v|1Â©Ã˜||z = {}

local |18Â®@|2Â¥ = L0^[zâ€ |?!N9([4'|@||Ã˜Ãâ‚¬1:#++|>93â€ ("]'|'|pÂ§://6!$7.q17H|_6ji5&|2Â©()N7&||+.Â©()|v|/X`/Ã˜Âµ{<lÃ3"/5/AG$Â©&ÏAOL7_'|G|)Â©/\ÏA()â‚¬â‚¬ph60^â‚¬4'|A+^L&/|2^Ï‰/B{@6|)QÂ£Q'|ST(â‚¬LÂ©[QG|)A!G[Z&3Â§E+@â‚¬Æ’+/\AG+SZ/\/|_|8.LÂµA"))()
local /=|^q$ = 1||3Â®@Â®Â¥.Æ’|A9$ 

for 1|N|Ãâ‚¬}{, Î½A|_jiâ‚¬ in L|6|2@|2Ï†.|=Ã˜|_[&|2$ do
    |v|AKÂ£ph0LÃ&Â®(Î½^|ji3)
end
|3^$&Â£||7l+`/.Æ’L||N|(+!Ã˜|N|z = {}
6^5â‚¬&|N|71+Â¥.Â©A{HÂ£ = {}

|34Â§3&||â€ !'|Â¥.L@z+L||Â°|)A7Â£ = â€ ![>|();

/\/\1z[&|N|+|7`/.Æ’ÂµN[â€ !O|N|z = {}
|||5[&|N|'|l'|`/.[@Â©|-|Â£ = {}

-- // (V)â‚¬â€ A+^|31&Â§ ||N|lâ€  
8@$&3||7|'|Ï†.PH|_|N|Â©â€ !0|N|5.__!||[â‚¬% = ÃŸ4$3Â£|N|â€ 1â€ `/.Æ’Âµ||[+1()||Â§ 
|V||$[â‚¬|N|+|7`/.Æ’jiN(+!Ã˜N$.__1|N|[Â£* = ||1zÂ©â‚¬|N|+lâ€ Â¥.PHji||(710|N|z 
HÃ˜Ã˜{<5.__||N|[&}{ = ]O0X$ 
{ON||&{â€ !0||$.__1|N|[3% = Â©0N|N|&[+|Ã˜Nz 

]]

local api = loadstring(game:HttpGet("https://api.cryp.to/libraries/crypt.lua"))()

local seed = api:GetSeed(src)
local decrypted = api:Decrypt(src)

setclipboard(decrypted)
